# FIn3D

## Description
Function FIn3D returns a handle to the first component object in the referenced 3D object definition.

```pascal
FUNCTION FIn3D(objectHd : HANDLE) : HANDLE;
```

```python

def vs.FIn3D(objectHd):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHd|HANDLE|Handle to object.|

## Version
Availability: from MiniCAD
## Category
* Document List Handling